task={
	
	firework_sound={
	},
	
	warn_unpin_when_no_pin={
		log=[[
+найти шаги по воспроизведению.	
	подобрать вещь
	разлогиниться
	залогиниться
		вещь на земле - 
			сделать чтобы осталась в руке
		при нажатии пробел - варн на клиенте
>>сделать чтобы вещь пиналась прогрузке - на клиенте
	по какой информации?
		внутреннее состояние Pin_service
			сделать передачу его состояния на клиент
				в общем первоначальном state
				который получается в onStateReceived на клиенте
				и идёт в GameState.set
	сделать гет и сет состояние пинсервиса.
	
	
>>сделать сохранение и загрузку пинов на сервере
	
		
		

		]]
	},
	
}