m={
	concept=[[
gen2 писать долго, думать много. на неё нужны ресурсы которых нет.
поэтому делаю лайт gen3
	однопользовательский
		локал кооп - сплит
	идея та же

Переписана с нуля
	чистый код
		поколение 2 как референс
	pow2
	
упрощения
	Одно разрешение HD 1280*720
	без текста и цифр, искуственных ui элементов

	]],
	log=[[
vsall
	функция перехода на левел
	портал который её вызывает
	
	
	
	
intention
	есть у каждой сущности
		интерфейс через функции
		очередь-потом, сейчас 1
	
	
	
	
+перемещение игрока
+отрисовка фона
+порядок отрисовки
	свойство layer у сущности учитывать при добавлении

+деревья
	




камера за игроком



	]],
	task={
		think=[[
левела с разными правилами. шутер, вампир киллер!, платф		
		]],
		vampire_killer=[[
		
		]],
		walk=[[
у сущности создается намерение		
	каждый кадр делается шаг
	trait movable
		посмотреть архитектуру трейтов из ген1
	



		]],
		
	},
	ideas=[[
ограничение 1 левел 1 экран, без скролла и камеры
	+легко кодить
	-мало места
		решение: оставить камеру как в 2 поколении
сны


структура проекта
	содержимое любой папки должно умещаться на экране

	]]
}




