m={
	concept=[[
gen2 писать долго, думать много. на неё нужны ресурсы которых нет.
поэтому делаю лайт gen3
	однопользовательский
		локал кооп - сплит
	идея та же

	код с нуля весь
		поколение 2 как референс

Переписана с нуля
	pow2
фиксированное разрешение
упрощения
	]],
	log=[[
перемещение игрока
+отрисовка фона
+порядок отрисовки
	свойство layer у сущности учитывать при добавлении

	


камера за игроком



	]],
	task={
		
	},
	ideas=[[
ограничение 1 левел 1 экран, без скролла и камеры		
	]]
}




